app/Modules/People/Models/PersonneModel.php

    public function findWithRelations(int $id): ?array
    {
        $row = $this->db->table('plaignant.personne AS p')
            ->select('
                p.personne_id,
                p.nom_personne,
                p.prenom_personne,
                p.date_naissance,
                p.email,
                p.telephone,
                p.numero_cni,
                p.upload_cni,
                p.adresse_residence,
                p.sexe_id,
                p.province_naissance_id,
                p.commune_naissance_id,
                p.zone_naissance_id,
                p.colline_naissance_id,
                p.create_at,
                s.description_sexe,
                prov.province_name AS province_naissance_name,
                com.commune_name AS commune_naissance_name,
                z.zone_name AS zone_naissance_name,
                col.colline_name AS colline_naissance_name
---
SELECT "p"."personne_id", "p"."nom_personne", "p"."prenom_personne", "p"."date_naissance", "p"."email", "p"."telephone", "p"."numero_cni", "p"."upload_cni", "p"."adresse_residence", "p"."sexe_id", "p"."province_naissance_id", "p"."commune_naissance_id", "p"."zone_naissance_id", "p"."colline_naissance_id", "p"."create_at", "s"."description_sexe", "prov"."province_name" AS "province_naissance_name", "com"."commune_name" AS "commune_naissance_name", "z"."zone_name" AS "zone_naissance_name", "col"."colline_name" AS "colline_naissance_name"
FROM "plaignant"."personne" AS "p"
LEFT JOIN "plaignant"."sexe" AS "s" ON "s"."sexe_id" = "p"."sexe_id"
LEFT JOIN "localite"."localite_province" AS "prov" ON "prov"."province_id" = "p"."province_naissance_id"
LEFT JOIN "localite"."localite_commune" AS "com" ON "com"."commune_id" = "p"."commune_naissance_id"
LEFT JOIN "localite"."localite_zone" AS "z" ON "z"."zone_id" = "p"."zone_naissance_id"
LEFT JOIN "localite"."localite_colline" AS "col" ON "col"."colline_id" = "p"."colline_naissance_id"
ORDER BY "p"."nom_personne" ASC, "p"."prenom_personne" ASC

    public function options(): array
    {
        $rows = $this->builder()
            ->select('personne_id, prenom_personne, nom_personne, numero_cni')
            ->orderBy('nom_personne', 'ASC')
            ->orderBy('prenom_personne', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT "personne_id", "prenom_personne", "nom_personne", "numero_cni"
FROM "plaignant"."personne"
ORDER BY "nom_personne" ASC, "prenom_personne" ASC