app/Modules/Complaint/Models/RolePersonneModel.php

    public function findWitnessId(): ?int
    {
        $row = $this->builder()
            ->select('role_personne_id')
            ->groupStart()
                ->like('UPPER(description_role_personne)', 'TEMOIN')
                ->orLike('UPPER(description_role_personne)', 'WITNESS')
            ->groupEnd()
            ->get()
            ->getRowArray();
---
SELECT "role_personne_id"
FROM "plaignant"."role_personne"
WHERE   (
UPPER(description_role_personne) LIKE '%TEMOIN%' ESCAPE '!'
OR  UPPER(description_role_personne) LIKE '%WITNESS%' ESCAPE '!'
 )