app/Modules/Complaint/Models/StatutPlainteModel.php

    public function options(?int $niveauId = null, bool $activeOnly = true): array
    {
        $builder = $this->builder()
            ->select('statut_plainte_id, description_statut_plainte, niveau_juridiction_id')
            ->orderBy('description_statut_plainte', 'ASC');

        if ($activeOnly) {
            $builder->where('is_active', true);
        }
        if ($niveauId !== null && $niveauId > 0) {
            $builder->where('niveau_juridiction_id', $niveauId);
        }

        return array_map(static fn (array $row): array => [
            'id'                    => $row['statut_plainte_id'],
            'label'                 => $row['description_statut_plainte'],
            'niveau_juridiction_id' => $row['niveau_juridiction_id'],
        ], $builder->get()->getResultArray());
---
SELECT "statut_plainte_id", "description_statut_plainte", "niveau_juridiction_id"
FROM "plainte"."statut_plainte"
ORDER BY "description_statut_plainte" ASC