app/Modules/CourtJurisdiction/Models/JuridictionModel.php

SELECT "juridiction_id", "code_juridiction", "nom_juridiction", "niveau_juridiction_id", "province_id", "commune_id"
FROM "juridiction"."juridiction"
WHERE (is_active IS NULL OR is_active = TRUE)
ORDER BY "nom_juridiction" ASC
---
    public function options(array $filters = []): array
    {
        $builder = $this->builder()
            ->select('juridiction_id, code_juridiction, nom_juridiction, niveau_juridiction_id, province_id, commune_id')
            ->orderBy('nom_juridiction', 'ASC');

        if (($filters['active_only'] ?? true) === true) {
            $builder->where('(is_active IS NULL OR is_active = TRUE)', null, false);
        }
        if (! empty($filters['niveau_juridiction_id'])) {
            $builder->where('niveau_juridiction_id', (int) $filters['niveau_juridiction_id']);
        }
        if (! empty($filters['province_id'])) {
            $builder->where('province_id', (int) $filters['province_id']);
        }
        if (! empty($filters['commune_id'])) {
            $builder->where('commune_id', (int) $filters['commune_id']);
        }

        $rows = $builder->get()->getResultArray();