app/Modules/CourtJurisdiction/Models/NiveauJuridictionModel.php

SELECT "niveau_juridiction_id", "desc_niveau_juridiction"
FROM "juridiction"."niveau_juridiction"
WHERE (is_active IS NULL OR is_active = TRUE)
ORDER BY "niveau_juridiction_id" ASC
---
    public function listFiltered(?bool $isActive = null): array
    {
        $builder = $this->builder()
            ->select('niveau_juridiction_id, desc_niveau_juridiction, is_active, is_recours')
            ->orderBy('niveau_juridiction_id', 'ASC');

        if ($isActive === true) {
            $builder->where('is_active', true);
        } elseif ($isActive === false) {
            $builder->groupStart()
                ->where('is_active', false)
                ->orWhere('is_active', null)
                ->groupEnd();
        }

        return $builder->get()->getResultArray();