app/Modules/Notification/Services/InboxNotificationService.php

SELECT COUNT(*) AS "numrows"
FROM "notification"."notification_utilisateur"
WHERE "utilisateur_id" = 4
AND "statut_notification_id" = 1
---
    public function unreadCount(int $utilisateurId): int
    {
        if ($utilisateurId < 1) {
            return 0;
        }

        try {
            return (int) db_connect()->table('notification.notification_utilisateur')
                ->where('utilisateur_id', $utilisateurId)
                ->where('statut_notification_id', self::UNREAD_STATUS_ID)
                ->countAllResults();

SELECT "n"."notification_utilisateur_id", "n"."sujet", "n"."corps", "n"."created_at", "n"."envoye_le", "n"."lu_le", "n"."statut_notification_id", "n"."canal_notification_id", "c"."description_canal_notification" AS "channel_label"
FROM "notification"."notification_utilisateur" AS "n"
LEFT JOIN "notification"."canal_notification" AS "c" ON "c"."canal_notification_id" = "n"."canal_notification_id"
WHERE "n"."utilisateur_id" = 4
AND "n"."statut_notification_id" = 1
ORDER BY "n"."created_at" DESC
 LIMIT 8
---
    public function unreadForUser(int $utilisateurId, int $limit = 8): array
    {
        if ($utilisateurId < 1) {
            return [];
        }

        try {
            $rows = db_connect()->table('notification.notification_utilisateur AS n')
                ->select('
                    n.notification_utilisateur_id,
                    n.sujet,
                    n.corps,
                    n.created_at,
                    n.envoye_le,
                    n.lu_le,
                    n.statut_notification_id,
                    n.canal_notification_id,
                    c.description_canal_notification AS channel_label
                ')
                ->join(
                    'notification.canal_notification AS c',
                    'c.canal_notification_id = n.canal_notification_id',
                    'left'
                )
                ->where('n.utilisateur_id', $utilisateurId)
                ->where('n.statut_notification_id', self::UNREAD_STATUS_ID)
                ->orderBy('n.created_at', 'DESC')
                ->limit(max(1, $limit))
                ->get()
                ->getResultArray();