app/Modules/Administration/Models/AuditLogModel.php

    public function record(
        string $action,
        string $table,
        ?int $recordId,
        ?array $old = null,
        ?array $new = null,
        ?int $utilisateurId = null
    ): void {
        $request = service('request');

        try {
            $this->insert([
                'utilisateur_id'    => $utilisateurId,
                'action'            => $action,
                'table_cible'       => $table,
                'enregistrement_id' => $recordId,
                'anciennes_valeurs' => $old === null ? null : json_encode($old, JSON_UNESCAPED_UNICODE),
                'nouvelles_valeurs' => $new === null ? null : json_encode($new, JSON_UNESCAPED_UNICODE),
                'adresse_ip'        => $request->getIPAddress(),
                'user_agent'        => substr((string) $request->getUserAgent(), 0, 500),
                'created_at'        => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO "audit_log"."audit_log" ("utilisateur_id", "action", "table_cible", "enregistrement_id", "anciennes_valeurs", "nouvelles_valeurs", "adresse_ip", "user_agent", "created_at") VALUES (4, 'UPDATE', 'plainte.type_document', 1, '{"type_document_id":"1","code_type_document":"CNI","libelle_type_document":"Carte d''identite","niveau_juridiction_id":"1","is_obligatoire":"t","is_actif":"t","created_at":"2026-08-08 08:33:44+02"}', '{"code_type_document":"CNI","libelle_type_document":"Carte d''identité","niveau_juridiction_id":1,"is_obligatoire":true}', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/150.0.0.0 Safari/537.36', '2026-08-08 08:34:33')