app/Modules/Administration/Models/NiveauJuridictionModel.php

SELECT "niveau_juridiction_id", "desc_niveau_juridiction"
FROM "juridiction"."niveau_juridiction"
WHERE (is_active IS NULL OR is_active = TRUE)
ORDER BY "niveau_juridiction_id" ASC
---
    public function options(): array
    {
        $rows = $this->builder()
            ->select('niveau_juridiction_id, desc_niveau_juridiction')
            ->where('(is_active IS NULL OR is_active = TRUE)', null, false)
            ->orderBy('niveau_juridiction_id', 'ASC')
            ->get()
            ->getResultArray();