app/Modules/Administration/Models/ProfilModel.php

    public function options(): array
    {
        $rows = $this->builder()
            ->select('profil_id, libelle_profil')
            ->where('(is_active IS NULL OR is_active = TRUE)', null, false)
            ->orderBy('libelle_profil', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT "profil_id", "libelle_profil"
FROM "administration"."profil"
WHERE (is_active IS NULL OR is_active = TRUE)
ORDER BY "libelle_profil" ASC