app/Modules/Administration/Models/StatutCompteModel.php

SELECT *
FROM "administration"."statut_compte"
WHERE "administration"."statut_compte"."statut_compte_id" = 1
---
    public function isActiveStatus(?int $statutCompteId): bool
    {
        if (! $statutCompteId) {
            return false;
        }

        $row = $this->find($statutCompteId);