app/Modules/Administration/Models/UtilisateurModel.php

UPDATE "administration"."utilisateur" SET "code_authentification" = '449231', "code_authentification_expire_at" = '2026-08-06 17:47:58'
WHERE "utilisateur_id" = 4
UPDATE "administration"."utilisateur" SET "code_authentification" = '449231'
WHERE "utilisateur_id" = 4
---
    public function setAuthenticationCode(int $utilisateurId, string $code, int $expiresAtUnix): bool
    {
        $expiresAt = (new \DateTimeImmutable('@' . $expiresAtUnix))
            ->setTimezone(new \DateTimeZone(date_default_timezone_get()))
            ->format('Y-m-d H:i:s');

        $db = $this->db;

        try {
            $ok = $db->table($this->table)
                ->where('utilisateur_id', $utilisateurId)
                ->update([
                    'code_authentification'           => $code,
                    'code_authentification_expire_at' => $expiresAt,
                ]);

            if ($ok !== false) {
                return true;
            }
        } catch (\Throwable $e) {
            log_message('warning', 'Saving 2FA code without expire column: {message}', [
                'message' => $e->getMessage(),
            ]);
        }

        try {
            $ok = $db->table($this->table)
                ->where('utilisateur_id', $utilisateurId)
                ->update(['code_authentification' => $code]);

UPDATE "administration"."utilisateur" SET "code_authentification" = NULL, "code_authentification_expire_at" = NULL
WHERE "utilisateur_id" = 4
UPDATE "administration"."utilisateur" SET "code_authentification" = NULL
WHERE "utilisateur_id" = 4
---
    public function clearAuthenticationCode(int $utilisateurId): bool
    {
        $db = $this->db;

        try {
            $ok = $db->table($this->table)
                ->where('utilisateur_id', $utilisateurId)
                ->update([
                    'code_authentification'           => null,
                    'code_authentification_expire_at' => null,
                ]);

            if ($ok !== false) {
                return true;
            }
        } catch (\Throwable $e) {
            // Column may not exist yet.
        }

        try {
            $ok = $db->table($this->table)
                ->where('utilisateur_id', $utilisateurId)
                ->update(['code_authentification' => null]);

SELECT *
FROM "administration"."utilisateur"
WHERE "administration"."utilisateur"."utilisateur_id" = 4
---
    public function purgeExpiredAuthenticationCode(int $utilisateurId): bool
    {
        $user = $this->find($utilisateurId);