app/Modules/AuditLog/Services/AuditLogListService.php

SELECT DISTINCT "action"
FROM "audit_log"."audit_log"
WHERE "action" IS NOT NULL
AND "action" <> ''
ORDER BY "action" ASC
SELECT DISTINCT "action"
FROM "audit_log"."audit_log_personne"
WHERE "action" IS NOT NULL
AND "action" <> ''
ORDER BY "action" ASC
---
    public function distinctActions(string $source): array
    {
        $table = $source === 'personne' ? 'audit_log.audit_log_personne' : 'audit_log.audit_log';

        try {
            $rows = db_connect()->table($table)
                ->distinct()
                ->select('action')
                ->where('action IS NOT NULL')
                ->where("action <> ''")
                ->orderBy('action', 'ASC')
                ->get()
                ->getResultArray();

SELECT DISTINCT "table_cible"
FROM "audit_log"."audit_log"
WHERE "table_cible" IS NOT NULL
AND "table_cible" <> ''
ORDER BY "table_cible" ASC
SELECT DISTINCT "table_cible"
FROM "audit_log"."audit_log_personne"
WHERE "table_cible" IS NOT NULL
AND "table_cible" <> ''
ORDER BY "table_cible" ASC
---
    public function distinctTables(string $source): array
    {
        $table = $source === 'personne' ? 'audit_log.audit_log_personne' : 'audit_log.audit_log';

        try {
            $rows = db_connect()->table($table)
                ->distinct()
                ->select('table_cible')
                ->where('table_cible IS NOT NULL')
                ->where("table_cible <> ''")
                ->orderBy('table_cible', 'ASC')
                ->get()
                ->getResultArray();