app/Modules/Administration/Services/AccountService.php

SELECT "created_at", "nouvelles_valeurs"
FROM "audit_log"."audit_log"
WHERE "utilisateur_id" = 4
AND "table_cible" = 'administration.utilisateur'
AND "enregistrement_id" = 4
AND "action" = 'UPDATE'
ORDER BY "created_at" DESC
 LIMIT 30
---
    private function lastPasswordChangedAt(int $utilisateurId): ?string
    {
        try {
            $row = db_connect()->table('audit_log.audit_log')
                ->select('created_at, nouvelles_valeurs')
                ->where('utilisateur_id', $utilisateurId)
                ->where('table_cible', 'administration.utilisateur')
                ->where('enregistrement_id', $utilisateurId)
                ->where('action', 'UPDATE')
                ->orderBy('created_at', 'DESC')
                ->limit(30)
                ->get()
                ->getResultArray();