app/Modules/Notification/Models/CanalNotificationModel.php

    public function options(?bool $activeOnly = null): array
    {
        $builder = $this->builder()
            ->select('canal_notification_id AS id, description_canal_notification AS label')
            ->orderBy('description_canal_notification', 'ASC');

        if ($activeOnly === true) {
            $builder->where('is_active', true);
        }

        return array_map(static fn (array $r): array => [
            'id'    => (int) $r['id'],
            'label' => (string) $r['label'],
        ], $builder->get()->getResultArray());
---
SELECT "canal_notification_id" AS "id", "description_canal_notification" AS "label"
FROM "notification"."canal_notification"
ORDER BY "description_canal_notification" ASC