app/Modules/Notification/Models/StatutNotificationModel.php

    public function options(): array
    {
        $rows = $this->builder()
            ->select('statut_notification_id AS id, description_statut_notification AS label')
            ->orderBy('statut_notification_id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT "statut_notification_id" AS "id", "description_statut_notification" AS "label"
FROM "notification"."statut_notification"
ORDER BY "statut_notification_id" ASC