app/Models/SexeModel.php

SELECT "sexe_id", "description_sexe"
FROM "plaignant"."sexe"
ORDER BY "sexe_id" ASC
---
    public function options(): array
    {
        $rows = $this->builder()
            ->select('sexe_id, description_sexe')
            ->orderBy('sexe_id', 'ASC')
            ->get()
            ->getResultArray();