app/Libraries/BackofficeAccess.php

    private static function currentPermissionState(int $utilisateurId): ?array
    {
        try {
            $row = db_connect()->table('administration.utilisateur')
                ->select('profil_id, statut_compte_id')
                ->where('utilisateur_id', $utilisateurId)
                ->get()
                ->getFirstRow('array');
---
SELECT "profil_id", "statut_compte_id"
FROM "administration"."utilisateur"
WHERE "utilisateur_id" = 4

    private static function catalogueRoutes(): array
    {
        if (self::$catalogueCache !== null) {
            return array_fill_keys(self::$catalogueCache, true);
        }

        try {
            $rows = db_connect()->table('administration.permission')
                ->select('url_route')
                ->where('is_active', true)
                ->get()
                ->getResultArray();
---
SELECT "url_route"
FROM "administration"."permission"
WHERE "is_active" = TRUE